In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)
df = pd.DataFrame(data, index=["John", "Gabriele", "Nicolo", "Antonio"], columns=["Wage", "Age", "Working Hour"])
df

              Wage       Age  Working Hour
John     -0.978444  0.422251     -0.047927
Gabriele -0.932502 -1.208142     -0.171069
Nicolo    0.226036 -1.685960      0.126519
Antonio   1.456155  0.337746     -1.344223

#### reset_index(): Removes the specified index name, new index names are default names

In [5]:
df.reset_index()

      index      Wage       Age  Working Hour
0      John -0.978444  0.422251     -0.047927
1  Gabriele -0.932502 -1.208142     -0.171069
2    Nicolo  0.226036 -1.685960      0.126519
3   Antonio  1.456155  0.337746     -1.344223

#### set_index(): sets given pandas series as new index

In [7]:
newIdxList = ["Joh", "Gab", "Nic", "Ant"]
df["New Idx"] = newIdxList
df

              Wage       Age  Working Hour New Idx
John     -0.978444  0.422251     -0.047927     Joh
Gabriele -0.932502 -1.208142     -0.171069     Gab
Nicolo    0.226036 -1.685960      0.126519     Nic
Antonio   1.456155  0.337746     -1.344223     Ant

In [8]:
df.set_index("New Idx")

             Wage       Age  Working Hour
New Idx
Joh     -0.978444  0.422251     -0.047927
Gab     -0.932502 -1.208142     -0.171069
Nic      0.226036 -1.685960      0.126519
Ant      1.456155  0.337746     -1.344223

In [9]:
df

              Wage       Age  Working Hour New Idx
John     -0.978444  0.422251     -0.047927     Joh
Gabriele -0.932502 -1.208142     -0.171069     Gab
Nicolo    0.226036 -1.685960      0.126519     Nic
Antonio   1.456155  0.337746     -1.344223     Ant

In [10]:
df.set_index("New Idx", inplace=True)

In [11]:
df

             Wage       Age  Working Hour
New Idx
Joh     -0.978444  0.422251     -0.047927
Gab     -0.932502 -1.208142     -0.171069
Nic      0.226036 -1.685960      0.126519
Ant      1.456155  0.337746     -1.344223